BusinessProcesses/ЗаявкаНаКомандировку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<BusinessProcess>
		<Properties>
			<Name>ЗаявкаНаКомандировку</Name>
			<Task>Task.ЗадачаИсполнителяПоСогласованиюПлатежей</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаявкаСогласованаСДиректоромСТП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаСогласованаСКурирующимЧП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаСогласованаСПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроектПриказаСогласованСДиректоромПД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроектПриказаСогласованСДиректоромФД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроектПриказаПодписанУДЧП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетКомандировочныхСогласованСЗамГБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетКомандировочныхСогласованСГБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЦС_СостоянияСогласованияПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГородНазначения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаНазначения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТранспорта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВидыТранспорта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриказНаКомандировку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КомандировкиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетКомандировочных</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасчетКомандировочных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЭлектронныеПодписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвансовыйОтчет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласующий1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласующий2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежноеПоручениеИсходящее</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОзнакомитьСОтчетом</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникЗамена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасходов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриказПодписывает</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КомментарииПроцесса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Эцп</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подпись</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Таблица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГородНазначения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Города</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТранспорта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ВидыТранспорта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТранспортаУбытие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ВидыТранспорта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

InformationRegisters/Бит_АдресацияУведомленийПоКомандировкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>Бит_АдресацияУведомленийПоКомандировкам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Адресат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦС_ЭтапыМаршрутовБП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЦС_СостоянияСогласованияПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ЦС_СостоянияСогласованияПлатежей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказанРуководителемДепартамента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказанФинансовымДепартаментом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказанИсполнителем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказанРуководителемФД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказанВР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УспешноЗавершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BusinessProcesses/ЗаявкаНаКомандировку/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
	Автор = ПараметрыСеанса.ТекущийПользователь;
	Состояние = Перечисления.ЦС_СостоянияСогласованияПлатежей.ВРаботе;	
	Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь,"ОсновнаяОрганизация");
	
КонецПроцедуры

Функция ПолучитьАдресатаДляТекущегоЭтапа(Постановщик,ТочкаЭтапа);
	
	Если ТочкаЭтапа = Справочники.ЦС_ЭтапыМаршрутовБП.ЗаполнениеРаботникомОтчетаОКомандировке Тогда
		Возврат Постановщик;
	ИначеЕсли ТочкаЭтапа = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСРуководителемСП Тогда
		 Возврат Согласующий1;
	ИначеЕсли ТочкаЭтапа = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСКурирующимЧП Тогда
		Возврат Согласующий2;
	ИначеЕсли ТочкаЭтапа = Справочники.ЦС_ЭтапыМаршрутовБП.ОзнакомлениеСАвансовымОтчетом Тогда
		Возврат ОзнакомитьСОтчетом;
	КонецЕсли;
	
	//Если ТочкаЭтапа = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСРуководителемСП Тогда
	//	
	//	Сотрудник = Справочники.СотрудникиОрганизаций.НайтиПоРеквизиту("Физлицо", ЭтотОбъект.ФизЛицо);
	//	Подразделение = Сотрудник.ТекущееПодразделениеОрганизации;
	//	
	//		Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Бит_АдресацияУведомленийПоКомандировкам.Адресат,
	//	|	Бит_АдресацияУведомленийПоКомандировкам.Пользователь КАК Пользователь
	//	|ИЗ
	//	|	РегистрСведений.Бит_АдресацияУведомленийПоКомандировкам КАК Бит_АдресацияУведомленийПоКомандировкам
	//	|ГДЕ
	//	|	(Бит_АдресацияУведомленийПоКомандировкам.Пользователь = &Пользователь
	//	|			ИЛИ Бит_АдресацияУведомленийПоКомандировкам.Пользователь = &ПустойПользователь)
	//	|	И Бит_АдресацияУведомленийПоКомандировкам.ЭтапМаршрута = &ЭтапМаршрута
	//	|	И Бит_АдресацияУведомленийПоКомандировкам.Подразделение = &Подразделение
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	Пользователь УБЫВ";
	//	
	//	Запрос.УстановитьПараметр("Пользователь", Постановщик);
	//	Запрос.УстановитьПараметр("ПустойПользователь", Справочники.Пользователи.ПустаяСсылка());
	//	Запрос.УстановитьПараметр("Подразделение", Подразделение);

	//	Запрос.УстановитьПараметр("ЭтапМаршрута", ТочкаЭтапа);
	//	
	//	Результат = Запрос.Выполнить();
	//	Выборка = результат.Выбрать();
	//	Если Выборка.Следующий() тогда
	//		Возврат Выборка.Адресат;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	
		Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Бит_АдресацияУведомленийПоКомандировкам.Адресат,
	|	Бит_АдресацияУведомленийПоКомандировкам.Пользователь КАК Пользователь
	|ИЗ
	|	РегистрСведений.Бит_АдресацияУведомленийПоКомандировкам КАК Бит_АдресацияУведомленийПоКомандировкам
	|ГДЕ
	|	(Бит_АдресацияУведомленийПоКомандировкам.Пользователь = &Пользователь
	|			ИЛИ Бит_АдресацияУведомленийПоКомандировкам.Пользователь = &ПустойПользователь)
	|	И Бит_АдресацияУведомленийПоКомандировкам.ЭтапМаршрута = &ЭтапМаршрута
	|
	|УПОРЯДОЧИТЬ ПО
	|	Пользователь УБЫВ";
	
	Запрос.УстановитьПараметр("Пользователь", Постановщик);
	Запрос.УстановитьПараметр("ПустойПользователь", Справочники.Пользователи.ПустаяСсылка());

	Запрос.УстановитьПараметр("ЭтапМаршрута", ТочкаЭтапа);
	
	Результат = Запрос.Выполнить();
	Выборка = результат.Выбрать();
	Если Выборка.Следующий() тогда
		Возврат Выборка.Адресат;
	КонецЕсли;
			
КонецФункции

Процедура ОбработатьЭтап(Постановщик, ТочкаЭтапа,ФормируемыеЗадачи,Отказ, ЯвныйАдресат = Неопределено)
	
	Если ТочкаЭтапа = Справочники.ЦС_ЭтапыМаршрутовБП.ОтправленНаДоработкуАвтором тогда 
		Адресат = Постановщик;
	Иначе    
		Если ЯвныйАдресат = Неопределено тогда
			Адресат = ПолучитьАдресатаДляТекущегоЭтапа(Постановщик,ТочкаЭтапа);
		Иначе
			Адресат = ЯвныйАдресат;	
		КонецЕсли;
		
	КонецЕсли;
	
	Если Адресат = Неопределено или Адресат.Пустая() тогда 
		Отказ = Истина;
		Сообщить("Для текущего пользователя на этапе "+ТочкаЭтапа+" не найден адресат");
		Возврат;
	КонецЕсли;
	
	Для Каждого Задача из ФормируемыеЗадачи Цикл
		
		Если ТипЗнч(Адресат) = Тип("СправочникСсылка.Пользователи") тогда
			Задача.Пользователь = Адресат;
		Иначе
			Задача.Подразделение = Адресат;
		КонецЕсли;
		ЦС_ОбщегоНазначенияСервер.ОтправитьПисьмоПоИзменениюЗаявок(Задача.бизнеспроцесс, Адресат, Задача);
	КонецЦикла;
	
	ЭтотОбъект.Записать();

КонецПроцедуры

Процедура ОбработатьВыборВарианта(ТочкаВыбораВарианта, Результат,МаркерЭтапа)
	
	Если МаркерЭтапа = "Согласовано" тогда
		Результат = ТочкаВыбораВарианта.Варианты.Согласовано;
	ИначеЕсли МаркерЭтапа = "Возвращено" тогда
		Результат = ТочкаВыбораВарианта.Варианты.Возвращено;
	ИначеЕсли МаркерЭтапа = "Отказано" тогда
		Результат = ТочкаВыбораВарианта.Варианты.Отказано;
		
		Завершен = Истина;
		Состояние = Перечисления.ЦС_СостоянияСогласованияПлатежей.Отказано;

	КонецЕсли;

КонецПроцедуры

Процедура ЧППроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Сотрудник = Справочники.СотрудникиОрганизаций.НайтиПоРеквизиту("Физлицо", ЭтотОбъект.ФизЛицо);
	
	Если Сотрудник.ТекущееПодразделениеОрганизации.Наименование = "Руководство" Тогда
		Результат = Истина;
	Иначе	
		Результат = Ложь;
	КонецЕсли;

КонецПроцедуры

Процедура СамолетИлиТальгоПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = Ложь;

	Для каждого Стр из Таблица Цикл
		Если Стр.ВидТранспорта = Справочники.бит_ВидыТранспорта.ЖДСкоростной ИЛИ Стр.ВидТранспорта = Справочники.бит_ВидыТранспорта.Самолет Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ТекущаяТочка = ТочкаМаршрутаБизнесПроцесса;
	
	Если ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ЗаявкаНаКомандировку.ТочкаМаршрута.СогласованиеСРП") Тогда
		Этап = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСРуководителемСП;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ЗаявкаНаКомандировку.ТочкаМаршрута.СогласованиеСКурирующимЧП")	Тогда
		Этап = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСКурирующимЧП;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ЗаявкаНаКомандировку.ТочкаМаршрута.СогласованиеСПП") Тогда
		Этап = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСПП;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ЗаявкаНаКомандировку.ТочкаМаршрута.СозданиеПроектаПриказаНаКомандировку")	Тогда
		Этап = Справочники.ЦС_ЭтапыМаршрутовБП.СозданиеПроектаПриказаНаКомандировку;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ЗаявкаНаКомандировку.ТочкаМаршрута.СогласованиеПроектаПриказаСПД")	Тогда
		Этап = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеПроектаПриказаСПД;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ЗаявкаНаКомандировку.ТочкаМаршрута.СогласованиеПроектаПриказаСФД") Тогда
		Этап = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеПроектаПриказаСФД;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ЗаявкаНаКомандировку.ТочкаМаршрута.ПодписаниеПроектаПриказаУДЧП") Тогда
		Этап = Справочники.ЦС_ЭтапыМаршрутовБП.ПодписаниеПроектаПриказаУДЧП;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ЗаявкаНаКомандировку.ТочкаМаршрута.РегистрацияПриказа")	Тогда
		Этап = Справочники.ЦС_ЭтапыМаршрутовБП.АДРегистрацияПриказа;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ЗаявкаНаКомандировку.ТочкаМаршрута.ДБУРасчетКомандировочных") Тогда
		Этап = Справочники.ЦС_ЭтапыМаршрутовБП.ДБУРасчетКомандировочных;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ЗаявкаНаКомандировку.ТочкаМаршрута.СогласованиеРасчетаСЗамГБ")	Тогда
		Этап = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеРасчетаСЗамГБ;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ЗаявкаНаКомандировку.ТочкаМаршрута.СогласованиеРасчетаСГБ") Тогда
		Этап = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеРасчетаСГБ;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ЗаявкаНаКомандировку.ТочкаМаршрута.ДБУПеречислениеДенег")	Тогда
		Этап = Справочники.ЦС_ЭтапыМаршрутовБП.ДБУПеречислениеДенег;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ЗаявкаНаКомандировку.ТочкаМаршрута.ЗаполнениеРаботникомОтчетаОКомандировке") Тогда
		Этап = Справочники.ЦС_ЭтапыМаршрутовБП.ЗаполнениеРаботникомОтчетаОКомандировке;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ЗаявкаНаКомандировку.ТочкаМаршрута.ДБУЗаполнениеАвансовогоОтчета")	Тогда
		Этап = Справочники.ЦС_ЭтапыМаршрутовБП.ДБУЗаполнениеАвансовогоОтчета;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ЗаявкаНаКомандировку.ТочкаМаршрута.ОзнакомлениеСАвансовымОтчетом") Тогда
		Этап = Справочники.ЦС_ЭтапыМаршрутовБП.ОзнакомлениеСАвансовымотчетом;
		
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ЗаявкаНаКомандировку.ТочкаМаршрута.СогласованиеРасчетаСГБ") Тогда
		Этап = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеРасчетаСГБ;

	КонецЕсли;	
	
	ОбработатьЭтап(Автор, Этап, ФормируемыеЗадачи, Отказ);
	
КонецПроцедуры

Процедура РезультатПроверкиВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекущаяТочка = ТочкаВыбораВарианта;
	Если ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ЗаявкаНаКомандировку.ТочкаМаршрута.РезультатПроверкиСТП") Тогда
		МаркерЭтапа = ЗаявкаСогласованаСДиректоромСТП;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ЗаявкаНаКомандировку.ТочкаМаршрута.РезультатПроверкиКурирующимЧП")	Тогда
		МаркерЭтапа = ЗаявкаСогласованаСКурирующимЧП; 
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ЗаявкаНаКомандировку.ТочкаМаршрута.РезультатПроверкиПП") Тогда
		МаркерЭтапа = ЗаявкаСогласованаСПП;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ЗаявкаНаКомандировку.ТочкаМаршрута.РезультатПроверкиПД")	Тогда
		МаркерЭтапа = ПроектПриказаСогласованСДиректоромПД;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ЗаявкаНаКомандировку.ТочкаМаршрута.РезультатПроверкиФД")	Тогда
		МаркерЭтапа = ПроектПриказаСогласованСДиректоромФД;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ЗаявкаНаКомандировку.ТочкаМаршрута.РезультатПроверкиУДЧП") Тогда
		МаркерЭтапа = ПроектПриказаПодписанУДЧП;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ЗаявкаНаКомандировку.ТочкаМаршрута.РезультатПроверкиЗамГБ")	Тогда
		МаркерЭтапа = РасчетКомандировочныхСогласованСЗамГБ;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ЗаявкаНаКомандировку.ТочкаМаршрута.РезультатПроверкиГБ") Тогда
		МаркерЭтапа = РасчетКомандировочныхСогласованСГБ;
	КонецЕсли;
	
	ОбработатьВыборВарианта(ТочкаВыбораВарианта, Результат, МаркерЭтапа);	
		
КонецПроцедуры

Процедура СлужебныйАвтотранспортПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = Ложь;

	Для каждого Стр из Таблица Цикл
		Если Стр.ВидТранспорта = Справочники.бит_ВидыТранспорта.ТранспортКомпании Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
